Repository: pedro-mendonca/theme-check
Catalog: lang/theme-check-*.po
Languages: pt_pt

source: Line
pt_pt: Linha

source: Visit author homepage
pt_pt: Visite o website do autor

source: Anonymous
pt_pt: Anónimo

source: User levels were deprecated in <strong>2.0</strong>. Please see <a href="https://codex.wordpress.org/Roles_and_Capabilities">Roles_and_Capabilities</a>
pt_pt: Os níveis de utilizador estão obsoletos desde <strong>2.0</strong>. Por favor veja <a href="https://codex.wordpress.org/Roles_and_Capabilities">Roles_and_Capabilities</a>.

source: WARNING
pt_pt: AVISO

source: Themes should use <strong>add_theme_page()</strong> for adding admin pages.
pt_pt: Os temas deverão utilizar <strong>add_theme_page()</strong> para adicionar páginas de administração.

source: REQUIRED
pt_pt: OBRIGATÓRIO

source: eval() is not allowed.
pt_pt: eval() não é permitido.

source: PHP system calls are often disabled by server admins and should not be in themes
pt_pt: Chamadas de sistema PHP são frequentemente desactivadas pelos administradores dos servidores e não deverão existir nos temas.

source: Themes should not change server PHP settings
pt_pt: Os temas não deverão alterar as definições de PHP do servidor.

source: %s is not allowed
pt_pt: %s não é permitido

source: Google search code detected
pt_pt: Código de pesquisa do Google detectado

source: Google advertising code detected
pt_pt: Código de anúncios do Google detectado

source: See: %s
pt_pt: Ver: %s

source: There must be a charset defined in the Content-Type or the meta charset tag in the head.
pt_pt: Tem que estar definida a codificação no <em>Content-Type</em> ou na tag <em>meta charset</em> no cabeçalho.

source: %s call in body tag
pt_pt: chamada %s na tag <em>body</em>

source: Could not find %s.
pt_pt: Não foi possível encontrar %s.

source: RECOMMENDED
pt_pt: RECOMENDADO

source: Found the URL of a CDN in the code: %s. You should not load CSS or Javascript resources from a CDN, please bundle them with the theme.
pt_pt: Foi encontrado o URL de CDN no código: %s. Não deverá carregar recursos de CSS ou Javascript a partir de CDN, por favor inclua-os no tema.

source: Could not find the %s script enqueued.
pt_pt: Não foi possível encontrar o script %s colocado na fila.

source: INFO
pt_pt: INFORMAÇÃO

source: Could not find the %s script enqueued, however a reference to 'comment-reply' was found. Make sure that the comment-reply script is being enqueued properly on singular pages.
pt_pt: Não foi possível encontrar o script %s colocado na fila, no entanto foi encontrada uma referência a 'comment-reply'. Verifique se o script comment-reply está colocado apropriadamente na fila em páginas singulares.

source: The theme doesn't have comment pagination code in it. Use %1$s or %2$s or %3$s or %4$s and %5$s to add comment pagination.
pt_pt: O tema não tem código de paginação de comentários. Utilize %1$s, ou %2$s, ou %3$s, ou %4$s e %5$s para adicionar paginação de comentários.

source: %1$s was found in the file %2$s.
pt_pt: %1$s encontrado no ficheiro %2$s.

source: Use %s instead.
pt_pt: Utilize %s em alternativa.

source: No content width has been defined.
pt_pt: Não foi definida a largura do conteúdo.

source: Example: %s
pt_pt: Exemplo: %s

source: No reference to %s was found in the theme.
pt_pt: Não foi encontrada referência a %s no tema.

source: It is recommended that the theme implement this functionality if using an image for the header.
pt_pt: É recomendado que o tema implemente esta funcionalidade se utilizar uma imagem para o cabeçalho.

source: If the theme uses background images or solid colors for the background, then it is recommended that the theme implement this functionality.
pt_pt: Se o tema utilizar imagens de fundo ou cores sólidas para o fundo, então é recomendado que o tema implemente esta funcionalidade.

source: Deprecated since version %s.
pt_pt: Obsoleto desde a versão %s.

source: Found wp_deregister_script in %1$s. Themes must not deregister core scripts.
pt_pt: Foi encontrado wp_deregister_script em %1$s. Os temas não podem anular o registo de scripts do core.

source: Please remove any extraneous directories like .git or .svn from the ZIP file before uploading it.
pt_pt: Por favor remova quaisquer directórios estranhos, tais como .git ou .svn do ficheiro ZIP antes de o carregar.

source: It is recommended that the theme implement editor styling, so as to make the editor content match the resulting post output in the theme, for a better user experience.
pt_pt: É recomendado que o tema implemente o editor com estilos, para o conteúdo no editor corresponder ao resultado da publicação apresentada pelo tema, e assim obter uma melhor experiência de utilização.

source: Possible Favicon found in %1$s. Favicons are handled by the Site Icon setting in the customizer since version 4.3.
pt_pt: Possível favicon encontrado em %1$s. Desde a versão 4.3 que os favicons são geridos pela definição <em>Ícone do site</em> no personalizador.

source: Windows thumbnail store
pt_pt: ficheiro de miniaturas Windows

source: Windows system file
pt_pt: ficheiro de sistema Windows

source: NetBeans Project File
pt_pt: ficheiro de projecto NetBeans

source: Komodo Project File
pt_pt: ficheiro de projecto Komodo

source: Hidden Files or Folders
pt_pt: ficheiro(s) ou pasta(s) escondido(s)

source: PHP server settings file
pt_pt: ficheiro de definições do servidor PHP

source: Dreamweaver project file
pt_pt: ficheiro de projecto Dreamweaver

source: PHP error log
pt_pt: Registo de erro PHP

source: Server settings file
pt_pt: ficheiro de definições do servidor

source: SQL dump file
pt_pt: ficheiro SQL dump

source: OSX system file
pt_pt: ficheiro de sistema OSX

source: Lubith theme generator file
pt_pt: ficheiro de gerador de tema Lubith

source: Please see <a href="https://codex.wordpress.org/Theme_Review#Theme_Documentation">Theme_Documentation</a> for more information.
pt_pt: Por favor veja <a href="https://codex.wordpress.org/Theme_Review#Theme_Documentation">Theme_Documentation</a> para mais informações.

source: %1$s %2$s found.
pt_pt: Foi encontrado %2$s %1$s.

source: Could not find the file %s in the theme.
pt_pt: Não foi possível encontrar o ficheiro %s no tema.

source: This theme appears to have been auto-generated. Generated themes are not allowed in the themes directory.
pt_pt: Este tema parece ter sido auto gerado. Temas gerados não são permitidos no directório de temas.

source: This theme doesn't seem to support the standard avatar functions. Use <strong>get_avatar</strong> or <strong>wp_list_comments</strong> to add this support.
pt_pt: Este tema parece não suportar as funções de avatar. Utilize <strong>get_avatar</strong> ou <strong>wp_list_comments</strong> para adicionar este suporte.

source: Possible variable %1$s found in translation function in %2$s. Translation function calls must NOT contain PHP variables.
pt_pt: Foi encontrada uma possível variável %1$s no ficheiro %2$s. As funções de tradução NÃO podem conter variáveis PHP.

source: iframes are sometimes used to load unwanted adverts and code on your site.
pt_pt: Os iframes são por vezes utilizados para carregar anúncios e códigos indesejados no seu site.

source: The theme appears to use %1$s or %2$s. If these are being used to include separate sections of a template from independent files, then %3$s should be used instead.
pt_pt: O tema parece utilizar %1$s ou %2$s. Se estas funções estiverem a ser utilizadas para incluir secções separadas de um modelo a partir de ficheiros independentes, então deverá utilizar %3$s em alternativa.

source: Both DOS and UNIX style line endings were found in the file %1$s. This causes a problem with SVN repositories and must be corrected before the theme can be accepted. Please change the file to use only one style of line endings.
pt_pt: Foram encontradas mudanças de linha com o estilo DOS e UNIX no ficheiro %1$s. Isto causa um problema com repositórios SVN e tem que ser corrigido para o seu tema ser aceite. Por favor altere o ficheiro para utilizar apenas um dos estilos de mudança de linha.

source: Possible hard-coded links were found in the file %1$s.
pt_pt: Foram encontradas possíveis ligações incluídas directamente no código do ficheiro %1$s.

source: File operations should use the WP_Filesystem methods instead of direct PHP filesystem calls
pt_pt: Operações de ficheiros deverão utilizar métodos WP_Filesystem em vez de chamadas do sistema de ficheiros do PHP.

source: Note that if your theme has a menu bar, it is required to use the WordPress %s functionality for it.
pt_pt: Se o seu tema tiver uma barra de menu, é obrigatório que utilize a funcionalidade do WordPress %s para o efeito.

source: Non-printable characters were found in the %s file. You may want to check this file for errors.
pt_pt: Foram encontrados caracteres não imprimíveis no ficheiro %s. Verifique se tem erros neste ficheiro.

source: Found PHP short tags in file %s.
pt_pt: Foram encontradas <em>tags</em> curtas de PHP no ficheiro %s.

source: The theme uses the %s function, which is plugin-territory functionality.
pt_pt: O tema utiliza a função %s, que é uma funcionalidade que deverá pertencer aos plugins.

source: The theme uses the %s function. Custom post-content shortcodes are plugin-territory functionality.
pt_pt: O tema utiliza a função %s. Shortcodes de post-content personalizados são funcionalidades que deverão pertencer aos plugins.

source: However %1$s and/or %2$s were not found, and no use of formats in the CSS was detected.
pt_pt: No entanto%1$s e/ou %2$s foram encontrados e não foi detectada a utilização de formatos de artigo no CSS.

source: The theme doesn't have post pagination code in it. Use %1$s or %2$s or %3$s or %4$s or %5$s and %6$s to add post pagination.
pt_pt: O tema não tem código de paginação de artigos. Utilize %1$s, ou %2$s, ou %3$s, ou %4$s, ou %5$s e %6$s para adicionar paginação de artigos.

source: It is recommended that the theme implement this functionality instead of using custom fields for thumbnails.
pt_pt: É recomendado que o tema implemente esta funcionalidade em alternativa a utilizar campos personalizados para imagens de destaque.

source: If the theme has a thumbnail like functionality, it should be implemented with %s in the functions.php file.
pt_pt: Se o tema tem uma funcionalidade tipo imagem de destaque, deverá ser implementada com %s no ficheiro functions.php.

source: Screenshot is wrong size! Detected: %1$sx%2$spx. Maximum allowed size is 1200x900px.
pt_pt: A captura do ecrã tem o tamanho errado! Detectado: %1$sx%2$spx. O tamanho máximo permitido é 1200x900px.

source: Screenshot dimensions are wrong! Ratio of width to height should be 4:3.
pt_pt: As dimensões da captura do ecrã estão erradas! O rácio da largura e altura deverá ser 4:3.

source: Screenshot size should be 1200x900, to account for HiDPI displays. Any 4:3 image size is acceptable, but 1200x900 is preferred.
pt_pt: O tamanho da captura de ecrã deverá ser 1200x900, para ter em conta ecrãs HiDPI. Qualquer tamanho de imagem com 4:3 é aceitável, mas é recomendado 1200x900.

source: No screenshot detected! Please include a screenshot.png or screenshot.jpg.
pt_pt: Nenhuma captura de ecrã detectada! Por favor inclua um screenshot.png ou creenshot.jpg.

source: Use %1$s instead of including %2$s directly.
pt_pt: Utilize %1$s em alternativa a incluir %2$s directamente.

source: %s is missing from your style.css header.
pt_pt: %s em falta no cabeçalho do seu style.css.

source: %s css class is needed in your theme css.
pt_pt: A classe CSS %s é necessária no CSS do seu tema.

source: See <a href="http://codex.wordpress.org/CSS#WordPress_Generated_Classes">the Codex</a> for an example implementation.
pt_pt: Ver o <a href="http://codex.wordpress.org/CSS#WordPress_Generated_Classes">Codex</a> para um exemplo de implementação.

source: %s is either empty or missing in style.css header.
pt_pt: %s está vazio ou em falta no cabeçalho do seu style.css.

source: Themes that use the tag accessibility-ready will need to undergo an accessibility review.
pt_pt: Os temas que utilizarem a tag <em>accessibility-ready</em> serão sujeitos a uma revisão de acessibilidade.

source: The %1$s and %2$s tags changed to %3$s and %4$s tags in WordPress 3.8. Additionally, the %5$s tag was added. Please change to using one of the new tags.
pt_pt: As tags %1$s e %2$s foram alteradas para %3$s e %4$s no WordPress 3.8. Foi ainda adicionada a tag %5$s. Por favor altere de modo a utilizar uma das novas tags.

source: Found wrong tag, remove %s from your style.css header.
pt_pt: Foi encontrada uma tag errada, remova %s do cabeçalho do seu style.css.

source: This theme doesn't seem to display tags. Modify it to display tags in appropriate locations.
pt_pt: Este tema parece não mostrar etiquetas. Modifique-o para apresentar etiquetas em locais apropriados.

source: Your theme appears to be in the wrong directory for the theme name. The directory name must match the slug of the theme. This theme's correct slug and text-domain is %s.
pt_pt: O seu tema parece estar no directório errado para o nome do tema. O nome do directório tem que corresponder à slug do tema. A slug e o text-domain deste tema é %s.

source: (If this is a child theme, you can ignore this error.)
pt_pt: (se este for um tema dependente, pode ignorar este erro.)

source: Found a translation function that has an incorrect number of arguments. Function %1$s, with the arguments %2$s
pt_pt: Foi encontrada uma função de tradução que tem umnúmero incorrecto de argumentos. A função %1$s, com os argumentos %2$s

source: Found a translation function that is missing a text-domain. Function %1$s, with the arguments %2$s
pt_pt: Foi encontrada uma função de tradução que não tem text-domain. A função %1$s, com os argumentos %2$s

source: More than one text-domain is being used in this theme. This means the theme will not be compatible with WordPress.org language packs.
pt_pt: Está a ser utilizado mais do que um text-domain neste tema. Isto significa que o tema não será compatível com os pacotes de idioma do WordPress.org.

source: The domains found are %s
pt_pt: Os domínios encontrados são %s

source: Only one text-domain is being used in this theme. Make sure it matches the theme's slug correctly so that the theme will be compatible with WordPress.org language packs.
pt_pt: Apenas está a ser utilizado um text-domain neste tema. Verifique se corresponde à slug do tema para ser compatível com os pacotes de idioma do WordPress.org.

source: The domain found is %s
pt_pt: O domínio encontrado é %s

source: At least one hard coded date was found in the file %1$s. Consider %2$s instead.
pt_pt: Foi encontrada pelo menos uma data incluída directamente no codigo do ficheiro %1$s. Considere utilizar %2$s em alternativa.

source: It is recommended that the theme implement this functionality for WordPress 4.1 and above.
pt_pt: É recomendado que o tema implemente esta funcionalidade para o WordPress 4.1 ou superior.

source: The theme needs to have %1$s tags, ideally in the %2$s file.
pt_pt: O tema tem que ter tags %1$s, idealmente no ficheiro %2$s.

source: The theme needs to have a call to %1$s, ideally in the %2$s file.
pt_pt: O tema tem que ter uma chamada para %1$s, idealmente no ficheiro %2$s.

source: The %1$s tags can only contain a call to %2$s. Use the %3$s filter to modify the output.
pt_pt: As tags %1$s só podem conter uma chamada para %2$s. Utilize o filtro %3$s para modificar o resultado.

source: Your Theme URI and Author URI should not be the same.
pt_pt: O seu URI do tema e URI do autor não deverão ser o mesmo.

source: Using a WordPress.org Theme URI is reserved for official themes.
pt_pt: A utilização de um URI do tema do WordPress.org é reservada para temas oficiais.

source: This theme contains no sidebars/widget areas. See <a href='https://codex.wordpress.org/Widgets_API'>Widgets API</a>
pt_pt: Este tema não contém áreas de barra lateral/widgets. Veja a <a href='https://codex.wordpress.org/Widgets_API'>Widgets API</a>.

source: The theme appears to use %1$s but no %2$s was found.
pt_pt: O tema parece utilizar %1$s, mas nenhum %2$s foi encontrado.

source: Sidebars need to be registered in a custom function hooked to the <strong>widgets_init</strong> action.
pt_pt: As barras laterais têm que ser registadas numa função personalizada na acção <strong>widgets_init</strong>.

source: This may be a script used by hackers to get control of your server!
pt_pt: Este script poderá ser utilizado por hackers para obter o controlo do seu servidor!

source: Tells a hacker what operating system your server is running
pt_pt: Diz ao hacker que sistema operativo está em execução no servidor.

source: Symptom of the "Pharma Hack"
pt_pt: Sintoma de "Pharma Hack"

source: Parent theme %1$s not found! You have to have parent AND child-theme installed!
pt_pt: Tema superior %1$s não encontrado! Tem que ter instalados o tema superior e o tema dependente!

source: Theme Info
pt_pt: Informações do tema

source: Title
pt_pt: Título

source: Version
pt_pt: Versão

source: Author
pt_pt: Autor

source: Author URI
pt_pt: URI do autor

source: Theme URI
pt_pt: URI do tema

source: License
pt_pt: Licença

source: License URI
pt_pt: URI da Licença

source: Tags
pt_pt: Etiquetas

source: Description
pt_pt: Descrição

source: This child theme requires at least version %1$s of theme %2$s to be installed. You only have %3$s please update the parent theme.
pt_pt: Este tema dependente requer pelo menos a versão %1$s do tema %2$s instalado. Apenas tem a versão %3$s, por favor actualize o tema superior.

source: This is a child theme. The parent theme is: %s. These files have been included automatically!
pt_pt: Este é um tema dependente. O tema superior é: %s. Estes ficheiros foram incluídos automaticamente!

source: Child theme does not have the <strong>Template Version</strong> tag in style.css.
pt_pt: O tema dependente não tem <strong>Template Version</strong> no style.css.

source: Child theme is only tested up to version %1$s of %2$s breakage may occur! %3$s installed version is %4$s
pt_pt: O tema dependente só foi testado até à versão %1$s do %2$s breakage may occur! %3$s installed version is %4$s, podem ocorrer erros! %3$s instalado na versão %4$s.

source: Running %1$s tests against %2$s using Guidelines Version: %3$s Plugin revision: %4$s
pt_pt: Executados %1$s testes em %2$s com as <em>Guidelines</em> versão: %3$s. Revisão do plugin: %4$s.

source: One or more errors were found for %1$s.
pt_pt: Foram encontrados um ou mais erros em %1$s.

source: %1$s passed the tests
pt_pt: %1$s passou os testes

source: <strong>WP_DEBUG is not enabled!</strong> Please test your theme with <a href="https://codex.wordpress.org/Editing_wp-config.php">debug enabled</a> before you upload!
pt_pt: <strong>O WP_DEBUG não está activado!</strong> Por favor teste o seu tema com <a href="https://codex.wordpress.org/Editing_wp-config.php">depuração activada</a> antes de o carregar!

source: About
pt_pt: Sobre

source: The Theme Check plugin is an easy way to test your theme and make sure it's up to date with the latest theme review standards. With it, you can run all the same automated testing tools on your theme that WordPress.org uses for theme submissions.
pt_pt: O plugin Theme Check é um modo simples e fácil de testar o seu tema e verificar se está de acordo com as últimas definições de revisão de temas. Com isto, poderá executar no seu tema as mesmas ferramentas automatizadas de teste que são utilizadas em WordPress.org na submissão de temas.

source: Contact
pt_pt: Contacto

source: Theme Check is maintained by %1$s and %2$s.
pt_pt: O Theme Check é mantido por %1$s e %2$s.

source: If you have found a bug or would like to make a suggestion or contribution, please leave a post on the <a href="%1$s">WordPress forums</a>, or talk about it with the theme review team on <a href="%2$s">Make WordPress Themes</a> site.
pt_pt: Se encontrou um erro ou gostaria de fazer alguma sugestão ou contribuição, por favor deixe um comentário no <a href="%1$s">Fórum do WordPress</a>, ou fale sobre isso com a equipa de revisão de temas no site <a href="%2$s">Make WordPress Themes</a>.

source: The code for Theme Check can be contributed to on <a href="%s">GitHub</a>.
pt_pt: Pode contribuir para o código do Theme Check no <a href="%s">GitHub</a>.

source: Testers
pt_pt: Equipa de testes

source: The WordPress Theme Review Team
pt_pt: Equipa de revisão de temas WordPress

source: Now that your theme has passed the basic tests you need to check it properly using the test data before you upload to the WordPress Themes Directory.
pt_pt: Agora que o seu tema passou os testes básicos, precisa de verificar utilizando os dados de teste antes de o carregar para o Directório de temas do WordPress.

source: Make sure to review the guidelines at <a href="https://codex.wordpress.org/Theme_Review">Theme Review</a> before uploading a Theme.
pt_pt: Reveja as <em>Guidelines</em> em <a href="https://codex.wordpress.org/Theme_Review">Theme Review</a> antes de carregar um tema.

source: Codex Links
pt_pt: Ligações do Codex

source: Theme Development
pt_pt: Desenvolvimento de temas

source: Themes and Templates forum
pt_pt: Fórum de temas e modelos

source: Check it!
pt_pt: Verificar!

source: Output in Trac format.
pt_pt: Resultados em formato <em>Trac</em>.

source: Suppress INFO.
pt_pt: Suprimir informações.

source: You do not have sufficient permissions to access this page.
pt_pt: Não tem permissãoes suficientes para aceder a esta página.

# title of the main page
source: Theme Check
pt_pt: Verificação de tema

source: A simple and easy way to test your theme for all the latest WordPress standards and practices. A great theme development tool!
pt_pt: Um modo simples e fácil de testar o seu tema de acordo com as últimas definições e práticas do WordPress. Uma óptima ferramenta de desenvolvimento de temas!
